/*
冒泡排序（Bubble Sort）
冒泡排序的基本思想是：两两比较相邻记录的关键字，如果反序则交换，直到没有反序的记录为止。
*/


#include <stdio.h>
#include <stdlib.h>
#include "list.h"


void BubbleSort(SqList *list) {
	int i, j;
	int flag = 1;
	for (i = 0; i < list->length && flag; i++) {
		flag = 0;
		for (j = list->length - 1; j > i; j--) {
			if (list->data[i] > list->data[j]) {
				swap(list, i, j); /* 交换 list->data[i] 与 list->data[j] 的值 */
				flag = 1;
			}
		}
	}
}


int main(int argc, char *argv[]) {
	SqList *list = InitList();
	int i;

	int arr[10];
	arr[0] = 7;
	arr[1] = 9;
	arr[2] = 8;
	arr[3] = 10;
	arr[4] = 3;
	arr[5] = 5;
	arr[6] = 4;
	arr[7] = 6;
	arr[8] = 1;
	arr[9] = 2;

	/* 按 arr 顺序插入 */
	for (i = 0; i < 10; i++) {
		ListInsert(list, i, arr[i]);
		printf("%d ", arr[i]);
	}
	printf("\n");

	/* 排序 12345... */
	BubbleSort(list);

	/* 输出排序后的结果 */
	for (i = 0; i < list->length; i++) {
		printf("%d ", list->data[i]);
	}
	printf("\n");
}


/*

以下面数组arr为例，我们喜欢排序后arr[0]的值是最小，我们从i=0开始，依次跟j=9至j=i＋1的数对比，将较小的数交换至i的位置；
为了减少比较，若某次 i 不执行交换，提前退出循环。
经过一次排序，最小的数到了正确的位置。


i = 0，j等于9、8时执行了交换
j    9  8  7  6  5  4  3  2  1
9  2  7  -  -  -  -  -  -  -  7
8  1  1  2  -  -  -  -  -  -  2
7  6  6  6  6  -  -  -  -  -  6
6  4  4  4  4  4  -  -  -  -  4
5  5  5  5  5  5  5  -  -  -  5
4  3  3  3  3  3  3  3  -  -  3
3  10 10 10 10 10 10 10 10 -  10
2  8  8  8  8  8  8  8  8  8  8
1  9  9  9  9  9  9  9  9  9  9
0  7  2  1  1  1  1  1  1  1  1


i = 1，j等于9、8时执行了交换
j     9  8  7  6  5  4  3  2
9  7  9  -  -  -  -  -  -  9
8  2  2  7  -  -  -  -  -  7
7  6  6  6  6  -  -  -  -  6
6  4  4  4  4  4  -  -  -  4
5  5  5  5  5  5  5  -  -  5
4  3  3  3  3  3  3  3  -  3
3  10 10 10 10 10 10 10 10 10
2  8  8  8  8  8  8  8  8  8
1  9  7  2  2  2  2  2  2  2
0  1  -  -  -  -  -  -  -  1


i = 2，j等于8、7、6、4时执行了交换
j     9  8  7  6  5  4  3
9  9  9  -  -  -  -  -  9
8  7  7  8  -  -  -  -  8
7  6  6  6  7  -  -  -  7
6  4  4  4  4  6  -  -  6
5  5  5  5  5  5  5  -  5
4  3  3  3  3  3  3  4  4
3  10 10 10 10 10 10 10 10
2  8  8  7  6  4  4  3  3
1  2  -  -  -  -  -  -  2
0  1  -  -  -  -  -  -  1


i = 3，j等于9、8、7、6、5、4时执行了交换
j     9  8  7  6  5  4
9  9  10 -  -  -  -  10
8  8  8  9  -  -  -  9
7  7  7  7  8  -  -  8
6  6  6  6  6  7  -  7
5  5  5  5  5  5  6  6
4  4  4  4  4  4  4  5
3  10 9  8  7  6  5  4
2  3  -  -  -  -  -  3
1  2  -  -  -  -  -  2
0  1  -  -  -  -  -  1


i = 4，不发生交换，提前退出循环。

*/

